RT-Thread/rt-thread/bsp/freescale/platform/devices/MK21DA5/include/MK21DA5_extension.h
/*! @brief Set the ERSSUSP field to a new value. */
#define FTFL_WR_FCNFG_ERSSUSP(base, value) (FTFL_RMW_FCNFG(base, FTFL_FCNFG_ERSSUSP_MASK, FTFL_FCNFG_ERSSUSP(value)))
#define FTFL_BWR_FCNFG_ERSSUSP(base, value) (BITBAND_ACCESS8(&FTFL_FCNFG_REG(base), FTFL_FCNFG_ERSSUSP_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FTFL_FCNFG, field ERSAREQ[5] (RO)
 *
 * Issues a request to the memory controller to execute the Erase All Blocks
 * command and release security. ERSAREQ is not directly writable but is under
 * indirect user control. Refer to the device's Chip Configuration details on how to
 * request this command. ERSAREQ sets when an erase all request is triggered
 * external to the flash memory module and CCIF is set (no command is currently being
 * executed). ERSAREQ is cleared by the flash memory module when the operation
 * completes.
 *
 * Values:
 * - 0b0 - No request or request complete
 * - 0b1 - Request to: run the Erase All Blocks command, verify the erased
 *     state, program the security byte in the Flash Configuration Field to the
 *     unsecure state, and release MCU security by setting the FSEC[SEC] field to the
 *     unsecure state.
 */
/*@{*/
/*! @brief Read current value of the FTFL_FCNFG_ERSAREQ field. */
#define FTFL_RD_FCNFG_ERSAREQ(base) ((FTFL_FCNFG_REG(base) & FTFL_FCNFG_ERSAREQ_MASK) >> FTFL_FCNFG_ERSAREQ_SHIFT)
#define FTFL_BRD_FCNFG_ERSAREQ(base) (BITBAND_ACCESS8(&FTFL_FCNFG_REG(base), FTFL_FCNFG_ERSAREQ_SHIFT))
/*@}*/

/*!
 * @name Register FTFL_FCNFG, field RDCOLLIE[6] (RW)
 *
 * Controls interrupt generation when a flash memory read collision error occurs.
 *
 * Values:
 * - 0b0 - Read collision error interrupt disabled
 * - 0b1 - Read collision error interrupt enabled. An interrupt request is
 *     generated whenever a flash memory read collision error is detected (see the
 *     description of FSTAT[RDCOLERR]).
 */
/*@{*/
/*! @brief Read current value of the FTFL_FCNFG_RDCOLLIE field. */
#define FTFL_RD_FCNFG_RDCOLLIE(base) ((FTFL_FCNFG_REG(base) & FTFL_FCNFG_RDCOLLIE_MASK) >> FTFL_FCNFG_RDCOLLIE_SHIFT)
#define FTFL_BRD_FCNFG_RDCOLLIE(base) (BITBAND_ACCESS8(&FTFL_FCNFG_REG(base), FTFL_FCNFG_RDCOLLIE_SHIFT))

/*! @brief Set the RDCOLLIE field to a new value. */
#define FTFL_WR_FCNFG_RDCOLLIE(base, value) (FTFL_RMW_FCNFG(base, FTFL_FCNFG_RDCOLLIE_MASK, FTFL_FCNFG_RDCOLLIE(value)))
#define FTFL_BWR_FCNFG_RDCOLLIE(base, value) (BITBAND_ACCESS8(&FTFL_FCNFG_REG(base), FTFL_FCNFG_RDCOLLIE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FTFL_FCNFG, field CCIE[7] (RW)
 *
 * Controls interrupt generation when a flash command completes.
 *
 * Values:
 * - 0b0 - Command complete interrupt disabled
 * - 0b1 - Command complete interrupt enabled. An interrupt request is generated
 *     whenever the FSTAT[CCIF] flag is set.
 */
/*@{*/
/*! @brief Read current value of the FTFL_FCNFG_CCIE field. */
#define FTFL_RD_FCNFG_CCIE(base) ((FTFL_FCNFG_REG(base) & FTFL_FCNFG_CCIE_MASK) >> FTFL_FCNFG_CCIE_SHIFT)
#define FTFL_BRD_FCNFG_CCIE(base) (BITBAND_ACCESS8(&FTFL_FCNFG_REG(base), FTFL_FCNFG_CCIE_SHIFT))

/*! @brief Set the CCIE field to a new value. */
#define FTFL_WR_FCNFG_CCIE(base, value) (FTFL_RMW_FCNFG(base, FTFL_FCNFG_CCIE_MASK, FTFL_FCNFG_CCIE(value)))
#define FTFL_BWR_FCNFG_CCIE(base, value) (BITBAND_ACCESS8(&FTFL_FCNFG_REG(base), FTFL_FCNFG_CCIE_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * FTFL_FSEC - Flash Security Register
 ******************************************************************************/

/*!
 * @brief FTFL_FSEC - Flash Security Register (RO)
 *
 * Reset value: 0x00U
 *
 * This read-only register holds all bits associated with the security of the
 * MCU and flash memory module. During the reset sequence, the register is loaded
 * with the contents of the flash security byte in the Flash Configuration Field
 * located in program flash memory. The flash basis for the values is signified by
 * X in the reset value.
 */
/*!
 * @name Constants and macros for entire FTFL_FSEC register
 */
/*@{*/
#define FTFL_RD_FSEC(base)       (FTFL_FSEC_REG(base))
/*@}*/

/*
 * Constants & macros for individual FTFL_FSEC bitfields
 */

/*!
 * @name Register FTFL_FSEC, field SEC[1:0] (RO)
 *
 * Defines the security state of the MCU. In the secure state, the MCU limits
 * access to flash memory module resources. The limitations are defined per device
 * and are detailed in the Chip Configuration details. If the flash memory module
 * is unsecured using backdoor key access, SEC is forced to 10b.
 *
 * Values:
 * - 0b00 - MCU security status is secure.
 * - 0b01 - MCU security status is secure.
 * - 0b10 - MCU security status is unsecure. (The standard shipping condition of
 *     the flash memory module is unsecure.)
 * - 0b11 - MCU security status is secure.
 */
/*@{*/
/*! @brief Read current value of the FTFL_FSEC_SEC field. */
#define FTFL_RD_FSEC_SEC(base) ((FTFL_FSEC_REG(base) & FTFL_FSEC_SEC_MASK) >> FTFL_FSEC_SEC_SHIFT)
#define FTFL_BRD_FSEC_SEC(base) (FTFL_RD_FSEC_SEC(base))
/*@}*/

/*!
 * @name Register FTFL_FSEC, field FSLACC[3:2] (RO)
 *
 * Enables or disables access to the flash memory contents during returned part
 * failure analysis at Freescale. When SEC is secure and FSLACC is denied, access
 * to the program flash contents is denied and any failure analysis performed by
 * Freescale factory test must begin with a full erase to unsecure the part.
 * When access is granted (SEC is unsecure, or SEC is secure and FSLACC is granted),
 * Freescale factory testing has visibility of the current flash contents. The
 * state of the FSLACC bits is only relevant when SEC is set to secure. When SEC
 * is set to unsecure, the FSLACC setting does not matter.
 *
 * Values:
 * - 0b00 - Freescale factory access granted
 * - 0b01 - Freescale factory access denied
 * - 0b10 - Freescale factory access denied
 * - 0b11 - Freescale factory access granted
 */
/*@{*/
/*! @brief Read current value of the FTFL_FSEC_FSLACC field. */
#define FTFL_RD_FSEC_FSLACC(base) ((FTFL_FSEC_REG(base) & FTFL_FSEC_FSLACC_MASK) >> FTFL_FSEC_FSLACC_SHIFT)
#define FTFL_BRD_FSEC_FSLACC(base) (FTFL_RD_FSEC_FSLACC(base))
/*@}*/

/*!
 * @name Register FTFL_FSEC, field MEEN[5:4] (RO)
 *
 * Enables and disables mass erase capability of the flash memory module. The
 * state of this field is relevant only when SEC is set to secure outside of NVM
 * Normal Mode. When SEC is set to unsecure, the MEEN setting does not matter.
 *
 * Values:
 * - 0b00 - Mass erase is enabled
 * - 0b01 - Mass erase is enabled
 * - 0b10 - Mass erase is disabled
 * - 0b11 - Mass erase is enabled
 */
/*@{*/
/*! @brief Read current value of the FTFL_FSEC_MEEN field. */
#define FTFL_RD_FSEC_MEEN(base) ((FTFL_FSEC_REG(base) & FTFL_FSEC_MEEN_MASK) >> FTFL_FSEC_MEEN_SHIFT)
#define FTFL_BRD_FSEC_MEEN(base) (FTFL_RD_FSEC_MEEN(base))
/*@}*/

/*!
 * @name Register FTFL_FSEC, field KEYEN[7:6] (RO)
 *
 * Enables or disables backdoor key access to the flash memory module.
 *
 * Values:
 * - 0b00 - Backdoor key access disabled
 * - 0b01 - Backdoor key access disabled (preferred KEYEN state to disable
 *     backdoor key access)
 * - 0b10 - Backdoor key access enabled
 * - 0b11 - Backdoor key access disabled
 */
/*@{*/
/*! @brief Read current value of the FTFL_FSEC_KEYEN field. */
#define FTFL_RD_FSEC_KEYEN(base) ((FTFL_FSEC_REG(base) & FTFL_FSEC_KEYEN_MASK) >> FTFL_FSEC_KEYEN_SHIFT)
#define FTFL_BRD_FSEC_KEYEN(base) (FTFL_RD_FSEC_KEYEN(base))
/*@}*/

